TesboCFD/tutorials/incompressible/pimpleFoam/laminar/contactAngleCavity/system/finite-area/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            none;
}

gradSchemes
{
    default             none;
    grad(Us)            Gauss linear;
}

divSchemes
{
    default             none;
    div(Us)             Gauss linear;
}

laplacianSchemes
{
    default             none;
    laplacian(Ds,Cs)    Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

lnGradSchemes
{
    default             corrected;
}


// ************************************************************************* //
